app/controllers/settings_controller.rb

SELECT * FROM `settings`
---
  def index
    @settings = Setting.all

SELECT * FROM `settings` WHERE (`settings`.`id` = 1)
---
  def show
    @setting = Setting.find(params[:id])

SELECT * FROM `settings` WHERE (`settings`.`id` = 1)
---
  def edit
    @setting = Setting.find(params[:id])

SELECT * FROM `settings` WHERE (`settings`.`id` = 1)
UPDATE `settings` SET `updated_at` = '2010-05-25 13:21:16', `value` = 'rWallpaper Demo' WHERE `id` = 1
---
  def update
    @setting = Setting.find(params[:id])
    if @setting.update_attributes(params[:setting])

UPDATE `settings` SET `updated_at` = '2010-05-25 14:11:58', `value` = 'rWallpaper Demo' WHERE `id` = 1
---
    def update_all
        Setting.update(params[:settings].keys, params[:settings].values)