app/controllers/wallpapers_controller.rb

    def index
        wallpaper=Wallpaper.new(params[:width].to_i,params[:height].to_i,Setting.find_by_key("img").value)
---
SELECT * FROM `settings` WHERE (`settings`.`key` = 'n') LIMIT 1